# Rebar Crank Overridable Parameters Get Crank Start Straight Length Formula Params Method

Source: https://www.revitapidocs.com/2026/23e45c1e-d6dd-30a4-2d0c-f015a1c4b339.htm

---

| Rebar Crank Overridable Parameters Get Crank Start Straight Length Formula Params Method |
| --- |

Gets the formula parameter ids defined in the RebarShape family which are associated with start crank straight length parameters.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ISet<ElementId> GetCrankStartStraightLengthFormulaParams()
```

```
Public Function GetCrankStartStraightLengthFormulaParams As ISet(Of ElementId)
```

```
public:
ISet<ElementId^>^ GetCrankStartStraightLengthFormulaParams()
```

```
member GetCrankStartStraightLengthFormulaParams : unit -> ISet<ElementId>
```

#### Return Value

ISet ElementId
Returns the formula parameter ids defined in the RebarShape family which are associated with start crank straight length parameters. See Also

#### Reference

RebarCrankOverridableParameters Class Autodesk.Revit.DB.Structure Namespace